IRP/src/Catalogs/ExternalFunctions/ExternalFunctions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ExternalFunctions</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ExternalFunctionType</name>
    <type>
      <types>EnumRef.ExternalFunctionType</types>
    </type>
  </attributes>
  <attributes>
    <name>Enable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalCode</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>UseForSetDescription</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SafeModeIsOn</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RegExp</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>isSchedulerSet</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>JobSchedule</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>DifficultLevel</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ResultType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Parameters</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>32</precision>
          <scale>10</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>TestRexExpStrings</name>
    <attributes>
      <name>Row</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ResultMatches</name>
    <attributes>
      <name>Result</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RegExp</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ExternalFunctions/ManagerModule.bsl
// @strict-types

// Presentation get processing.
// 
// Parameters:
//  Data - See CatalogRef.ExternalFunctions
//  Presentation - String - Presentation
//  StandardProcessing - Boolean - Standard processing
Procedure PresentationGetProcessing(Data, Presentation, StandardProcessing)
	
	If Not Data.UseForSetDescription Then
		Return;
	EndIf;
	
	StandardProcessing = False;

	Params = CommonFunctionsServer.GetRecalculateExpressionParams();
	Params.SafeMode = Data.SafeModeIsOn;
	Params.Expression = Data.ExternalCode;
	
	ResultInfo = CommonFunctionsServer.RecalculateExpression(Params);
	If ResultInfo.isError Then
		Presentation = R().Error_119;
	Else
		Presentation = String(ResultInfo.Result);
	EndIf;
	
EndProcedure

Procedure PresentationFieldsGetProcessing(Fields, StandardProcessing)
	StandardProcessing = False;
	Fields.Add("ExternalFunctionType");
	Fields.Add("SafeModeIsOn");
	Fields.Add("ExternalCode");
	Fields.Add("UseForSetDescription");
	Fields.Add("Description");
EndProcedure
